{"p": "There was something magical about that first playthrough of Elden Ring – when everything was new and there was a prevailing sense of discovery and awe as I rode through The Lands Between, stumbling upon the horrors of Caelid, the beautiful vistas of Limgrave and Liurnia, and the treasures that awaited after a challenging dungeon. Which is why my three hours with Elden Ring’s DLC: Shadow of the Erdtree was so exciting, because it felt like I was playing Elden Ring again for the first time, in a brand new realm to explore, with new discoveries, new surprises, new gear, and you’d better believe new challenges, even despite my provided level 150 character with end-game level gear.  My three hour play session began at the Cocoon of the Empyrean Site of Grace, which is where you do battle with the optional boss  Mohg: The Lord of Blood . But this time, instead of an empty boss room, there was an NPC named Leda there as well, who asked me if I too was beckoned by Miquella. By examining the cocoon with Miquella’s withered arm ominously hanging out, I was whisked away to the Realm of Shadow.  It’s hard to get a sense for just how big the Realm of Shadow actually is, but I will say that my first steps out into it were definitely reminiscent of the first time I emerged from the elevator and opened the doors into Limgrave. There were obvious areas of interest right from the get-go for me to explore, like a crypt that was directly to my left, some scorched ruins directly up ahead, a large castle far off in the distance, and the towering flaming brazier enemy from the trailer roaming around just on the horizon.  Of course, in true Elden Ring fashion, the very first enemy I encountered ended up murdering me, as if to reassure me that despite my level 150 character with a +25 strength scaled axe, along with 80 points allocated to strength, this DLC wasn’t going to be a cake walk for people with end game builds that have run out of things to challenge them in the base game. It wasn’t even a boss, it was just a random enemy that decided to drop down from above while I was exploring some ruins, with its dual-wielded chakrams that kept me tumbling backwards as I tried to dodge its twirling dance that never seemed to end.  Once I got my revenge and a paltry couple thousand runes for my trouble – again, this was just a normal run-of-the-mill enemy – I made a break down the beaten path and wound up at the first big dungeon of the DLC: Belurat. The ultimate goal of the DLC is to follow Miquella’s crosses, which essentially act as Miquella’s footprints and signpost the plot-critical path. The first one I found also came with a message that read: “The Gate of Divinity Lies in the Tower sealed by Shadow. That is surely where Kind Miquella is headed. We are no Empyreans but we must locate the path that will lead us there. I will follow the crosses east.” Belurat itself was a fairly large dungeon that was somewhere between the size of something like Stormveil Castle and Castle Morne. It’s not quite the size of a Legacy Dungeon from the main game, but still pretty lengthy and filled with plenty of optional side paths, many of which I didn’t get the opportunity to fully explore. It was a fortress filled with all sorts of new nasties, from scorpions of both the small and gigantic varieties, to relatively weak guards that liked to hide around corners waiting to ambush me, to Gravebirds that sat perched on the ramparts, to heavily armored knights with giant weapons that would occasionally use shoulder charges to bash into me from 15 feet away. Every enemy I fought was a new encounter for me to learn, which was an exciting challenge to overcome. The boss of Belurat is one that you no doubt will remember if you watched the reveal trailer. It’s called the Divine Beast, Dancing Lion. It was a difficult fight, and one that required me to make use of one of the new summons in Shadow of the Erdtree: Black Knight Commander Andreas, along with swapping my weapon from the heavy hitting Fireknight’s Fire Greatsword to the much more nimble Backhand Blade, which allowed me to hit and run much more easily. Perhaps the coolest aspect of this particular boss was the fact that its second phase has it alternating between ice and lightning power ups, forcing you to also have to contend with either random lightning strikes, or massive AOE ice attacks that build up frostbite, on top of also avoiding his heavy hitting attacks. Eventually I prevailed, gaining the Lion’s head to wear as a helmet (horrifying, but cool), and his remembrance, and moved on to the second main dungeon: Castle Ensis. This place reminded me much more of the Caria Manor, minus, you know, all of the horrifying hand monsters. There were lots of magic-wielding enemies, including a giant in Carian Armor that was much like Bol’s from one of the evergaol boss fights, and an extremely difficult Carian Knight that brought to mind the fight against the enemy that guarded Renalla’s chambers in the Academy of Raya Lucaria. Fitting, because this enemy guarded Relanna, who I probably spent at least 30 to 40 minutes trying to beat.  Relanna was definitely the hardest boss to take down during the preview window, combining fearsome melee sword skills with extremely powerful magic attacks. In her second phase, her two swords would be imbued with red and blue flames, giving them all new attacks that would set the arena ablaze and make them extremely difficult to get out of the way of. And just when I thought I had the win in the bag, she’d float up in the sky and cast a version of Renalla’s Full Moon that would crash into the ground for three devastating shockwaves that could basically one-shot me from full health. If it isn’t clear already, Shadow of the Erdtree is hard, but you’re not left completely without a lifeline. Scattered throughout the Realm of Shadow are Scadurtree Fragments that can be brought back to a site of grace and turned in, much like you would a Sacred Tear, or Golden Seed. These fragments will decrease the amount of damage enemies deal to you, but only while you’re in the Realm of Shadow. In addition to that, you can also find Revered Spirit Ash blessings, which can be turned in the same way, but these will instead increase the amount of damage dealt by your spirit summons.  While I didn’t get to explore the optional paths as much as I would have liked in my three hours of playtime, I still managed to find plenty of  brand new weapons , talismans, armor sets, cookbooks and crafting guides, and even an Ancient Dragon Smithing Stone. The new weapons were very cool too, with some really unique properties and weapon arts that made them behave quite differently from anything in the main game. The Heavy Smithscript Axe, for instance, could be thrown with a press of the heavy attack button, without any sort of cost or resource tied to it, making it very effective both at a distance and close up. The Milady weapon art puts you into a stance with your arm stretched out to the side, and from the stance you can do a number of cool follow-ups, like a leaping and lunging stab that’s very reminiscent of one of Malenia’s attacks. The Backhand Blade actually can be split into two swords when you dual wield it and has a super sick weapon skill that has you dashing to an enemy’s side for a stab to their ribs.  I felt like I accomplished a lot in my three hours of playtime with Shadow of the Erdtree, but even then, it still felt like there was so much left on the table. Right when my time ended, I was just about to explore a path marked by another one of Miquella’s crosses that led down into what seemed like one of FromSoftware’s famous poison swamps, and just by listening in on other players at the event, it was clear that I missed at least one other dungeon with a seemingly exciting boss fight that I’m very much looking forward to attempting myself. Fortunately the wait isn’t much longer now as Elden Ring: Shadow of the Erdtree is set to release on June 21. In the meantime, make sure to check out our list covering all of the  Shadow of the Erdtree New Weapon Types  and our guide of  How to Prepare for the Shadow of the Erdtree DLC.  Mitchell Saltzman is a senior guides producer at IGN. You can find him on twitter  @JurassicRabbit"}
